# Задание 1:
# Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.
from cgitb import text


def my_func(arg_1, arg_2):
    try:
        result = arg_1 / arg_2
        return result
    except ZeroDivisionError:
        return "На ноль делить нельзя!"


print(my_func(int(input("Введите первое число: ")), int(input("Введите второе число: "))))



# Задание 2:
# Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя:
# имя, фамилия, год рождения, город проживания, email, телефон.
# Функция должна принимать параметры как именованные аргументы.
# Реализовать вывод данных о пользователе одной строкой.


def my_func(name, surname, birth_year, city, email, phone):
    print(name, surname, birth_year, city, email, phone)


my_func(name='Marina', surname='Kravetc', birth_year=1987, city='Moscow', email='kravetc@gmail.com', phone=84959379992)



# Задание 3:
# Реализовать функцию my_func(), которая принимает три позиционных аргумента, и возвращает сумму наибольших двух аргументов.


def my_func(a, b, c):
    if a >= b or b >= c:
        return a + b
    elif a >= b or c <= b:
        return a + c
    else:
        return b + c


print(my_func(int(input('Введите 1 аргумент: ')), int(input('Введите второй аргумент: ')), int(input('Введите третий аргумент: '))))



# Задание 4:
# Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.


def my_func(x, y):
    if y == 0:
        return 1
    return x * my_func(x, y + 1)


print(my_func(int(input('Введите положительное число: ')), int(input('Введите отрицательное число: '))))


# Задание 5.
# Программа запрашивает у пользователя строку чисел, разделенных пробелом.
# При нажатии Enter должна выводиться сумма чисел.
# Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
# Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введен после нескольких чисел,
# то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу.

def my_sum():
    sum_res = 0
    number = False
    while number == False:
        numbers = input('Введите строку чисел, для завершения программы нажмите /: ').split()

        res = 0
        for el in range(len(numbers)):
            if numbers[el] == '/':
                number = True
                break
            else:
                res = res + int(numbers[el])
        sum_res = sum_res + res
        print(f'Текущая сумма чисел: {sum_res}')
    print(f'Итоговая сумма чисел: {sum_res}')


my_sum()



# Задание 6:
# Реализовать функцию int_func(), принимающую слово из маленьких латинских букв и возвращающую его же,
# но с прописной первой буквой. Например, print(int_func(‘text’)) -> Text.
# Продолжить работу над заданием. В программу должна попадать строка из слов, разделенных пробелом.
# Каждое слово состоит из латинских букв в нижнем регистре.
# Сделать вывод исходной строки, но каждое слово должно начинаться с заглавной буквы.
# Реобходимо использовать написанную ранее функцию int_func().

def int_func(*args):
    word = input('Введите слово: ')
    print(word.title())
    return


print(int_func())